[
    {
    "code":"bg-warning",
    "id":"jane",
    "name":"Jane Oh, Ph.D.",
    "title": "Clinical Psychologist",
    "license":"PSY26714",
    "photo":"assets/img/teams/02.jpg",
    "video":"https://www.youtube.com/embed/d5zh-jdtT3A",
    "bio":"I started on my journey to learn about human relationships at UC Davis where I received my bachelor's degrees in psychology and sociology. I continued my education at California School of Professional Psychology at Alliant International University earning a master's and doctoral degree. I began my training with a focus on child and family psychotherapy through community clinics providing services to foster children and low income families. Through my training I have gained expertise in working with children and teens through individual and family therapy. Working with families has allowed me gain expertise in working with individuals of various ages with consideration of how family history and relationships impact who they are and obstacles they may face. I have successfully assisted parents in strengthening their parenting skills while helping them feel empowered. Upon licensure I began working with children ages 2-5 focused on assisting caregivers with building a strong positive relationship in order for both caregiver and child to become resilient and successful. I am currently working on certification in Parent Child Interaction Therapy through UC Davis. I also have a passion for working with children and adults with ADHD knowing that the challenges can be a lifelong struggle. I work with a strength based approach knowing that individuals have internal resources to help them overcome any difficulties they are facing. Knowing that humans and relationships are constantly evolving, I continue my journey in professional development in an effort to learn approaches that will best help individuals."
  },
      {
    "code":"bg-primary",
    "id":"tammy",
    "name":"Tammy Moshrefi, AMFT",
    "title": "Associate Marriage and Family",
    "license":"AMFT144643",
    "photo":"assets/img/teams/22.jpg",
    "video":"",
    "bio":"Hello and welcome! My name is Tammy Moshrefi and I am an Associate Marriage and Family Therapist working under the supervision of Dr. Inga Simonian. I applaud you in taking the first step towards healing, self awareness and discovering your authentic self. My goal as a therapist is to support and empower individuals struggling with complex disorders and those who simply need help trying to navigate their way through life. My approach to therapy is client centered, which means we will work collaboratively to develop an approach that works best for you in reaching your goals. Vulnerability can be difficult and I thank you for allowing me to be part of your healing journey. "
  },
    {
    "code":"bg-success",
    "id":"rosanna",
    "name":"Rosanna Daragchyan, LMFT",
    "title": "Marriage and Family Therapist",
    "license":"LMFT111393",
    "photo":"assets/img/teams/03.jpg",
    "video":"https://www.youtube.com/embed/VLvtG1wjNF4",
    "bio":"I completed my graduate work at California State University, Northridge. My program is nationally accredited by the Commission for the Accreditation of Marriage and Family Therapy Education, and is one of two such accredited programs in the region. I received excellent training from impeccable instructors and supervisors that not only provided the therapeutic techniques and strategies necessary for the therapeutic process, but also genuinely cared for the well being of clients. I have provided therapy for individuals, children, adolescents, couples, groups, and families. I am trained in using systemic, collaborative, humanistic, strength based, and evidence based theoretic approaches. My treatment style is always adapted to the clients' individual needs. I specialize in treating mental and emotional disorders, such as depression, anxiety, cognitive disabilities, grief and loss, and various adjustment disorders. I value the importance of a trusting relationship between therapist and client. I strive to provide safety and comfort to discuss subjects freely, without the fear of judgment or shame. I also recognize the importance of being culturally aware of the differences and pressures family customs or beliefs can have on individuals. My goal is to provide a healing experience that allows for growth and strength to be accentuated, while providing tools and skills that can be used daily. This is your personal path of discovery, I am simply a messenger on the way."
  },
    {
    "code":"bg-info",
    "id":"suzanne",
    "name":"Suzanne Smith, Psy.D.",
    "title": "Psychological Associate",
    "license":"PSB9402125",
    "photo":"assets/img/teams/04.jpg",
    "video":"https://www.youtube.com/embed/uy_A7-HplTg",
    "bio":"I am a psychological assistant with a doctorate degree in Clinical Psychology specializing in working with children, adolescents, and adults who are experiencing a wide range of behavioral, developmental, emotional, and relational difficulties. My approach is primarily cognitive behavioral evidence based therapy. My focus is on present day concerns, abolishing the self-defeating behaviors, empowering clients reduce stress, and lead emotionally balanced and fulfilling life.I specialize in: Dealing with parental stress and depression raising children with developmental challenges such as Autism Spectrum Disorders (ASD), and ADHD. Improving parent child communication, and decreasing parental stress. I help parents to understand children's unique emotional needs, and specific communication styles. Working with adults: I provide a supportive environment for healing. I help to facilitate positive change for my clients. I work with individuals who seek help with a wide range of concerns, such as anxiety, depression, anger, stress, post-traumatic stress disorder, relationship issues, and work related problems. I focus on creating a safe place for my clients in a welcoming, warm and caring practice, offering the safety to explore and express painful and difficult emotions in a confidential setting."
  },
      {
    "code":"bg-success",
    "id":"edgar",
    "name":"Edgar Petrosyan, Psy.D.",
    "title": "Psychological Associate",
    "license":"PSB94027183",
    "photo":"assets/img/teams/07.jpg",
    "video":"https://youtube.com/embed/_P0cJwk3XPk",
    "bio":"Hello, my name is Dr. Edgar Petrosyan, and I am a Psychological Assistant with a Doctoral Degree in Clinical Psychology, with Emphasis in Depth Psychology, a modality primarily based on the theories of Carl G. Jung.  My approach to helping clients is based on the understanding that as we move forward in life/time, we come across challenges that sometimes make it difficult for us to move forward.  These challenges may have been experienced anytime from infancy to adulthood.  Due to the passage of time and natural defenses, we may no longer be aware of how we are still affected by the difficulties experienced in our past, which may be nothing more than a feeling, or a pattern of relationships.  These effects may be embodied as depression, anxiety, addiction, relationship difficulties, and so on.  My goal as your therapist will be to help you build a better relationship with yourself by challenging you to navigate through the difficult emotions at an appropriate pace, which will naturally lead to improved relationships and overall happiness.  I approach each of my clients as unique individuals, a uniqueness that some may say is forged by chance, such as, year of birth, culture and family in which the person is born into, childhood experiences, personality traits, unconscious drives, and so on.  Therefore, I approach each individual with the respect that all these factors, as well as those not mentioned, helped forge you into a one of a kind masterpiece in the making, a work of art for which there is no replica."
  },
       {
    "code":"bg-info",
    "id":"irene",
    "name":"Irene Hernandez, LMFT",
    "title": "Marriage and Family Therapist",
    "license":"LMFT132720",
    "photo":"assets/img/teams/15.jpg",
    "video":"https://www.youtube.com/embed/4dXq183UPeA",
    "bio":"Hello and welcome! My name is Irene and I am passionate about helping others find a sense of self and holistic wellbeing. I am a licensed marriage and family therapist who works with both adults and adolescents seeking to find ways in which to grow and live a fulfilling life. By empowering my clients to learn to create boundaries and foster loving relationships with both themselves and those around them and creating healthy habits. I work with clients on identifying triggers and assist with adjusting the negative mindset to create a more positive outlook. I am a client centered therapist that believes working with the client collaboratively to develop an approach that works best for your individual needs. I have experience working with depression, anxiety, grief, adjustment and transitions throughout life stages. Great job on taking the first step of reaching out, I look forward to hearing from you and being apart of your journey of healing."
  },
        {
    "code":"bg-warning",
    "id":"shani",
    "name":"Shani Habibi, Ph.D.",
    "title": "Licensed Psychologist",
    "license":"PSY26779",
    "photo":"assets/img/teams/13.jpg",
    "video":"",
    "bio":"Shani Habibi is an Associate Professor and the Director of the Masters in Science program at Mount Saint Mary's University.   She received her Ph.D. in Clinical Psychology with an emphasis in Multicultural Communications from the California School of Professional Psychology at Alliant International University and has been studying bisexuality for 18 years. She is trained as a Cognitive Behavioral Therapist as well as a Systemic Therapist and has treated clients in a variety of clinical settings, mainly in a community mental health clinic and at an inpatient psychiatric hospital."
  },
        {
    "code":"bg-primary",
    "id":"amanda",
    "name":"Amanda Romero, Ed.D., MSW",
    "title": "Clinical Social Worker",
    "license":"ASW 87895",
    "photo":"assets/img/teams/16.jpg",
    "video":"https://www.youtube.com/embed/96SQVn8nJtc",
    "bio":"I believe that we all have the characteristics to face life's challenges, but sometimes we may need some help recognizing our strengths. I utilize a multidimensional approach to therapy, exploring each individual's biological, psychological, social, and spiritual needs. I like to assist in helping others heal from trauma, build self-worth, improve communication in relationships, and reach goals. With compassion and understanding, I work with each individuals to help them build on their strengths and attain the personal growth they are committed to accomplishing."
  },      
  {
    "code":"bg-warning",
    "id":"michelle",
    "name":"Michelle Melendres, Ed.D., MSW",
    "title": "Clinical Social Worker",
    "license":"ASW 97729",
    "photo":"assets/img/teams/17.jpg",
    "video":"https://www.youtube.com/embed/BKdNMvCKzhg",
    "bio":"My name is Dr. Michelle Melendres and I am an Associate Clinical Social Worker, under the supervision of Dr. Inga Simonian. Originally from Hawaii, I have a Master of Science in Social Work from Columbia University and a Doctoral Degree in Education from the University of California, Los Angeles. Because everyone's journey and circumstances are different, my therapeutic approach is one that is customized specifically to you, cognizant of your unique background and understanding the complex intersectionality of your identity. I integrate a mindfulness-based approach through an in-depth assessment that will focus on your strengths and build your capacity to be present. Through the work we do, my hope is to empower you to cultivate self-compassion to feel much more balanced and whole. While working with you, I will incorporate an ecological framework and biological, psychological, social, and spiritual approach that takes into consideration all aspects of who you are, what your circumstances are, the environment in which you are in, and the changes that come with these."
  },
        {
    "code":"bg-primary",
    "id":"stefanie",
    "name":"Stefanie Garcia, LMFT",
    "title": "Marriage and Family Therapist",
    "license":"LMFT111393",
    "photo":"assets/img/teams/12.jpg",
    "video":"",
    "bio":"My name is Stefanie Garcia and it is my calling to serve and guide people on their journey toward healing and finding their inner strength. In my 8 years of practice as a Marriage and Family Therapist, I have ministered to adults, families and children from all walks of life who have been struggling with issues ranging from depression and anxiety to new motherhood, childhood behavior issues, trauma, Department of Child and Family Services (DCFS) cases and those looking to find meaning toward the end of their lives. As a strengths based cognitive behavioral therapist, I work to empower clients to use their own strengths to discover new ways to change their lives. I provide a safe and compassionate environment where clients can explore their thoughts, feelings, and experiences without judgment. I help clients identify the thought processes that create and maintain their negative view of themselves, others, and the world around them. Through talk therapy, I assist the client in shifting they way they view and approach their lives in order for them to foster loving relationships with themselves and others. I work to highlight the client's inner resources to help them successfully navigate any situation that challenges them in life. I understand how difficult it can be to struggle with emotional pain and I feel truly honored when my clients allow me to join them on their journey of healing."
  },
   {
    "code":"bg-info",
    "id":"diamond",
    "name":"Diamond Huffman, Psy.D.",
    "title": "Psychological Assistant",
    "license":"PSB94025755",
    "photo":"assets/img/teams/19.jpg",
    "video":"",
    "bio":"Throughout all of my experiences I have worked with an extremely diverse clientele. Diversity and understanding the importance of social and cultural factors, and identity development has always been an interest of mine. My specialization is working in diversified communities of color primarily with at risk youth and young adults suffering from substance misuse, depression, anxiety and trauma."
  },
    {
    "code":"bg-success",
    "id":"douye",
    "name":"Douye Youduba, Psy.D., MSW",
    "title": "Psychological Associate",
    "license":"PSB94026636",
    "photo":"assets/img/teams/20.jpg",
    "video":"",
    "bio":"Welcome! My name is Dr. D. Youduba and I am a Psychological Associate with a Doctoral Degree in Clinical Psychology working under the supervision of Dr. Shagheyegh Habibi. I will start by saying that the issues of life can be challenging and daunting which can cause one to feel a sense of fear, uneasiness, powerlessness, imbalance, hopelessness, weariness, disconnectedness, shame, anger, and the list goes on. However, there is hope in the face of seeking help. As a therapist, my primary goal is to be of service to you and collaborate with you on your journey of self-discovery and utilizing your strengths to overcome the challenges before you. To make you feel welcomed and comfortable, I will also provide you with a safe and therapeutic space that allows you to explore and express your innermost feelings, thoughts, emotions, and life experiences. I have extensive experience working with diverse populations on issues such as mood disorders such as depression, anxiety, trauma-related issues, relationship challenges, self-esteem issues, and grief and loss. Through a collaborative effort, I am here to assist you in exploring your concern(s) and empowering you in embracing a new perspective towards attaining positive overcomes. I employ a strengths-based, wholistic approach as well as draw from a variety of treatment modalities such as cognitive-behavioral therapy, psycho-dynamic, and rational-emotive counseling that is tailored to meet your individual needs. I also integrate self-awareness and mindfulness in my therapeutic style which would assist you in developing in-depth insight and focus on the present. I hope to have the opportunity to collaborate with you and to be of service in actualizing your mental health goal(s)."
  },
  {
    "code":"bg-warning",
    "id":"Ken",
    "name":"Kenichi Mekaru, ASW",
    "title": "Associate Clinical Social Worker",
    "license":"ASW112801",
    "photo":"assets/img/teams/25.jpg",
    "video":"https://www.youtube.com/embed/DFRP1f30mc4",
    "bio":"Hi everyone, my name is Ken Mekaru. I am a psychotherapist at Conscious Connections Psychology Group, under the supervision of Kristen Muché (LCSW #82170). I am originally from Okinawa, Japan and speak both Japanese and English. My area of expertise is HIV/AIDS and LGBTQ+. I have worked in hospital intensive outpatient programs and nonprofit organization settings. I have worked with people struggling with emotional regulation, relationship issues, psychological distress, mood swings, and substance use. I incorporate Cognitive Behavioral Therapy, Dialectical Behavior Therapy, and Motivational Interviewing. Those modalities help us to re-wire our way of thinking, create harmony, peace and mindfulness, and discover new perspectives. I’m looking forward to working with you."
  },
  {
    "code":"bg-success",
    "id":"daina",
    "name":"Daina Castro, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT128350",
    "photo":"assets/img/teams/23.jpg",
    "video":"https://www.youtube.com/embed/OoDvYUem93I",
    "bio":"Hello, my name is Daina Castro, and I am an Associate Marriage and Family therapist working under the supervision of Dr. Inga Simonian.  I welcome you to therapy and I truly am so happy that you are taking this next step in your life. My role as a therapist is to help you discover your most authentic self and achieve your goals through a safe, non-judgmental, and compassionate space. I believe that therapy is a collaborative experience, and I work with each and every one of my clients to gain their trust as well as form a relationship with them. I look forward to meeting with you and starting our journey together."
  },
  {
    "code":"bg-primary",
    "id":"alexis",
    "name":"Alexis Mendez, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT131616",
    "photo":"assets/img/teams/24.jpg",
    "video":"",
    "bio":"Hello, I am happy that you are here! My name is Alexis and I am an Associate Marriage and Family Therapist, under the supervision of Inga Simonian Ph.D. I am also a certified trauma informed yoga instructor. I am passionate about helping people holistically heal from past trauma, stress, anxiety or depression. I enjoy working with adults and couples that are ready to live a more authentic life and create moments of more genuine happiness by awakening their inner child. In our work together, I strive to help you explore the deeper parts of yourself through the use of somatic and breathing practices. My goal is to support you in your healing and self-discovery journey. I believe in the mind-body-spirit connection and help you heal by taking a holistic and collaborative approach. I create a safe and welcoming space for all my clients to be their authentic selves. I enjoy working with clients that are interested in diving deep into their psyche to rediscover themselves. Areas that I am informed in working with include trauma, identity, spirituality, mindfulness, LGBTQIA+, nonmonogamy, and sex and intimacy issues."
  },
   {
    "code":"bg-info",
    "id":"lara",
    "name":"Lara Loest, Psy.D.",
    "title": "Psychological Assistant",
    "license":"PSB94026628",
    "photo":"assets/img/teams/26.jpg",
    "video":"https://www.youtube.com/embed/oQeQ1i77tmE",
    "bio":"Welcome! I'm glad you are here! My name is Lara Loest and I am a psychological associate working under the supervision of Dr. Inga Simonian. I work with trauma survivors and people experiencing anxiety, depression, PTSD, and other stressful life events. I also have experience with eating disorders and domestic violence recovery. My specialties include providing trauma-informed and culturally-sensitive care to a diverse population through the use of treatments like Narrative Exposure Therapy, DBT skills, mindfulness techniques, and a holistic strengths-based perspective. What that means for you is that together we will focus on discovering your natural skills and strengths to work through whatever difficulties you are experiencing right now. Let's find your unique path to living your most fulfilling life. I'm excited for your journey and look forward to being a part of it. "
  },
   {
    "code":"bg-success",
    "id":"Gayaneh",
    "name":"Gayaneh Parsanj, ACSW",
    "title": "Associate Clinical Social Worker",
    "license":"ACSW115944",
    "photo":"assets/img/teams/27.jpg",
    "video":"",
    "bio":"In my role as a therapist, I take a collaborative approach that invites humor and complexity, helps you organize your thoughts, untangle yourself from mental confusion, and embrace life as you see fit. Emotional challenges may stem from perspectives that no longer work for us, a lack of an understanding of our true selves, and challenging circumstances. I strive to help others overcome these challenges in their day to day. Whether they stem from attachment ruptures, grief and loss, or trauma, I'm here to support you navigate life and have someone capable of being an effective resource for you."
  },
    {
    "code":"bg-warning",
    "id":"Rozmary",
    "name":"Rozmary Tatevosian, Psy.D.",
    "title": "Psychological Assistant",
    "license":"PSB94027013",
    "photo":"assets/img/teams/28.jpg",
    "video":"",
    "bio":"Hello there! My name is Rozmary Tatevosian, and I am a psychological associate working under the supervision of Dr. Inga Simonian. I believe therapy is the space to rediscover yourself, your emotions, likes, and hobbies. We will work together to overcome and process trauma, anxious thoughts, depressed moods, and day-to-day challenges. I work with adolescents and adults; my approach is collaborative, utilizing different modalities, such as Cognitive Behavioral Therapy, Psychodynamic, and Mindfulness techniques. "
  },
    {
    "code":"bg-info",
    "id":"Noura",
    "name":"Noura Chehade, APCC",
    "title": "Associate Professional Clinical Counselor",
    "license":"APCC12536",
    "photo":"assets/img/teams/29.jpg",
    "video":"https://www.youtube.com/embed/jqOEGyVZUZ4",
    "bio":"Hello and glad you’re here! I am an Associate Professional Clinical Counselor working under the license of Inga Simonian, PhD. I completed my Master's Degree at Alliant International University, where a major focus of study was cultural diversity including ethnicity, gender, age, socio-economic status, sexuality, and spirituality. Whether you may be feeling stuck in one place or are in too many places at once, I'm here to guide you and collaborate with you to make changes where you need it. Therapy can be the opportunity to look deeply into yourself or just have the opportunity to express what's on your mind. I believe that learning about yourself can give you a solid base to be able to lead a healthy and aligned life. Know that this is your safe space to be who you are and express freely. I am here to guide you in your most purposeful life path by aligning your personal values to your life experience. Areas that I am informed/affirmative include and not limited to: mindfulness, trauma, spirituality, LGBTQ+, kink, alternative relationships, career transition, life transitions, effective communication, romantic relationships, friendships, identity."
  },
    {
    "code":"bg-primary",
    "id":"Claudia",
    "name":"Claudia DuVal, APCC",
    "title": "Associate Professional Clinical Counselor",
    "license":"APCC15283",
    "photo":"assets/img/teams/30.jpg",
    "video":"https://youtu.be/embed/GNcZafMZs",
    "bio":"Hello and glad you’re here! I am an Associate Professional Clinical Counselor working under the license of Inga Simonian, PhD. I completed my Master’s degree in Clinical Counseling from Alliant International University (CACREP accredited) San Diego. I am member of the honor society Chi Sigma Iota, American Counseling Association, and California Association for Licensed Professional Clinical Counselors. I am the daughter of an immigrant single mother and a mother of two sourpatch kiddos. I understand the unique lived experiences of Latina mamas and other marginalized women of color. I am bilingual in English and Spanish and offer telehealth. Areas that I am informed/affirmative include and not limited to: maternal mental health, mindfulness, polyvagal theory, trauma, spirituality, career transition, life transitions, effective communication, romantic relationships, friendships, identity. My area of expertise is perinatal mental health. In addition to my own postpartum experiences, I have been trained by Postpartum Support International on maternal mental health. I am also a volunteer for the organization and provide new mothers, fathers, and families with empathy and support. In my role, I am also a researcher and locate local and national resources for help seekers. I use a unique approach customized to the individual. I work with young children, teens, young adults, parents, and grandparents. My work is derived from Narrative Theory and belief that everyone has a unique story to share. As authors of our own lives, we can use Cognitive Behavioral Therapy (CBT) to make connections between our thoughts, feelings, and behaviors. We can use nature to calm our nervous system and practice mindfulness to be present in the moment. I also lean heavily on psychoeducation and provide resources like books, podcasts, informational videos, and many more tools to help you cope with life stressors when we are not together in session."
  }
]
