[
    {
    "code":"bg-success",
    "id":"jane",
    "name":"Jane Oh, Ph.D.",
    "title": "Clinical Psychologist",
    "license":"PSY26714",
    "photo":"assets/img/teams/02.jpg",
    "video":"https://www.youtube.com/embed/d5zh-jdtT3A",
    "bio":"I started on my journey to learn about human relationships at UC Davis where I received my bachelor's degrees in psychology and sociology. I continued my education at California School of Professional Psychology at Alliant International University earning a master's and doctoral degree. I began my training with a focus on child and family psychotherapy through community clinics providing services to foster children and low income families. Through my training I have gained expertise in working with children and teens through individual and family therapy. Working with families has allowed me gain expertise in working with individuals of various ages with consideration of how family history and relationships impact who they are and obstacles they may face. I have successfully assisted parents in strengthening their parenting skills while helping them feel empowered. Upon licensure I began working with children ages 2-5 focused on assisting caregivers with building a strong positive relationship in order for both caregiver and child to become resilient and successful. I am currently working on certification in Parent Child Interaction Therapy through UC Davis. I also have a passion for working with children and adults with ADHD knowing that the challenges can be a lifelong struggle. I work with a strength based approach knowing that individuals have internal resources to help them overcome any difficulties they are facing. Knowing that humans and relationships are constantly evolving, I continue my journey in professional development in an effort to learn approaches that will best help individuals."
  },
      {
    "code":"bg-primary",
    "id":"jon",
    "name":"Jon Vorpe, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT121481",
    "photo":"assets/img/teams/22.jpg",
    "video":"https://www.youtube.com/embed/YHVkQZPZujM",
    "bio":"Hi! My name is Jon Vorpe and I am an Associate Marriage & Family Therapist, working under the supervision of Dr. Inga Simonian. I believe that therapy is a space where radical transformation and change can occur. I actively cultivate patient trust in the ever-evolving process of growth. I believe strongly in the value of bonding with clients so they understand that I am on their journey alongside them. The therapeutic relationship is a collaboration and a beautiful experience that I believe can be a powerful source of awakening. I can’t wait to meet you and start our journey together. "
  },
    {
    "code":"bg-success",
    "id":"rosanna",
    "name":"Rosanna Daragchyan,LMFT",
    "title": "Marriage and Family Therapist",
    "license":"LMFT111393",
    "photo":"assets/img/teams/03.jpg",
    "video":"https://www.youtube.com/embed/VLvtG1wjNF4",
    "bio":"I completed my graduate work at California State University, Northridge. My program is nationally accredited by the Commission for the Accreditation of Marriage and Family Therapy Education, and is one of two such accredited programs in the region. I received excellent training from impeccable instructors and supervisors that not only provided the therapeutic techniques and strategies necessary for the therapeutic process, but also genuinely cared for the well being of clients. I have provided therapy for individuals, children, adolescents, couples, groups, and families. I am trained in using systemic, collaborative, humanistic, strength based, and evidence based theoretic approaches. My treatment style is always adapted to the clients' individual needs. I specialize in treating mental and emotional disorders, such as depression, anxiety, cognitive disabilities, grief and loss, and various adjustment disorders. I value the importance of a trusting relationship between therapist and client. I strive to provide safety and comfort to discuss subjects freely, without the fear of judgment or shame. I also recognize the importance of being culturally aware of the differences and pressures family customs or beliefs can have on individuals. My goal is to provide a healing experience that allows for growth and strength to be accentuated, while providing tools and skills that can be used daily. This is your personal path of discovery, I am simply a messenger on the way."
  },
    {
    "code":"bg-info",
    "id":"suzanne",
    "name":"Suzanne Smith, Psy.D.",
    "title": "Psychological Assistant",
    "license":"PSB9402125",
    "photo":"assets/img/teams/04.jpg",
    "video":"https://www.youtube.com/embed/uy_A7-HplTg",
    "bio":"I am a psychological assistant with a doctorate degree in Clinical Psychology specializing in working with children, adolescents, and adults who are experiencing a wide range of behavioral, developmental, emotional, and relational difficulties. My approach is primarily cognitive behavioral evidence based therapy. My focus is on present day concerns, abolishing the self-defeating behaviors, empowering clients reduce stress, and lead emotionally balanced and fulfilling life.I specialize in: Dealing with parental stress and depression raising children with developmental challenges such as Autism Spectrum Disorders (ASD), and ADHD. Improving parent child communication, and decreasing parental stress. I help parents to understand children's unique emotional needs, and specific communication styles. Working with adults: I provide a supportive environment for healing. I help to facilitate positive change for my clients. I work with individuals who seek help with a wide range of concerns, such as anxiety, depression, anger, stress, post-traumatic stress disorder, relationship issues, and work related problems. I focus on creating a safe place for my clients in a welcoming, warm and caring practice, offering the safety to explore and express painful and difficult emotions in a confidential setting."
  },
      {
    "code":"bg-success",
    "id":"flo",
    "name":"Flo Stueck, AMFT",
    "title": "Marriage Family Therapist",
    "license":"AMFT116047",
    "photo":"assets/img/teams/07.jpg",
    "video":"https://www.youtube.com/embed/TfZtOZ0M0NI",
    "bio":"My passion as a therapist is the belief that human relationships are fostered by the practice of self-compassion, courage, and connection. I will guide you using a culturally-inclusive and trauma-informed perspective that includes listening with an empathic and non-judgmental lens. I will incorporate complementary interdisciplinary strategies from Cognitive Behavior Therapy (CBT), strengths based, person-centered, and mindfulness when appropriate to your goals. My areas of expertise are humans who self-identify under umbrellas of diversity. I believe all identities should be recognized and supported, including validating sexual and gender identity labels such as LGBTQIA+ individuals and couples, as well as folks who practice relationship diversity on a spectrum from monogamy to ethical non-monogamy. I earned my Master's of Science in Counseling Psychology from Mount Saint Mary's University in Los Angeles and my Bachelor's degree from Wesleyan University in Connecticut. As an Associate Marriage and Family Therapist practicing under Dr. Inga Simonian, a licensed psychologist, I have experience working with adolescents, seniors, couples, and individuals. I strive to create a safe space where perceived vulnerabilities and imperfections can be redefined and embraced as positive catalysts to healing energy and authentic growth. I believe human beings are worthy of belonging and love, and I hope to collaborate with you on your courageous journey of healing your body, mind, and spirit."
  },
       {
    "code":"bg-primary",
    "id":"irene",
    "name":"Irene Hernandez, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT109745",
    "photo":"assets/img/teams/15.jpg",
    "video":"https://www.youtube.com/embed/4dXq183UPeA",
    "bio":"Hello! I am Irene Hernandez, I am a registered marriage family and child therapist associate working under the licensed clinician of Theresa Journeau-Collins LMFT. I earned my masters at the University of Phoenix, where I obtained training with the Pomona Unified school district in their school mental health department. There I worked with families and provided individual therapy to children and adolescents. I also currently work at BHC Alhambra hospital in the assessment and referral department where I am trained in risk assessment skills with suicidal patients diagnosed with various psychotic and depressive disorders. As a therapist I am passionate about helping individuals find a sense of self and holistic wellbeing. My specialties' include various aspects of depression, anxiety, grief and loss, adjustment disorders, etc. Approaches I use in therapy include but are not limited to cognitive behavioral therapy, behavioral therapy, art therapy, play therapy, reality therapy, solution-focused therapy, and narrative therapy. I believe in working with the client collaboratively to develop an approach that best works for each individuals needs. I look forward to speaking with you!"
  },
        {
    "code":"bg-warning",
    "id":"shani",
    "name":"Shani Habibi, Ph.D.",
    "title": "licensed Psychologist",
    "license":"PSY26779",
    "photo":"assets/img/teams/13.jpg",
    "video":"",
    "bio":"Shani Habibi is an Associate Professor and the Director of the Masters in Science program at Mount Saint Mary's University.   She received her Ph.D. in Clinical Psychology with an emphasis in Multicultural Communications from the California School of Professional Psychology at Alliant International University and has been studying bisexuality for 18 years. She is trained as a Cognitive Behavioral Therapist as well as a Systemic Therapist and has treated clients in a variety of clinical settings, mainly in a community mental health clinic and at an inpatient psychiatric hospital."
  },
        {
    "code":"bg-primary",
    "id":"amanda",
    "name":"Amanda Romero, Ed.D., MSW",
    "title": "Clinical Social Worker",
    "license":"ASW 87895",
    "photo":"assets/img/teams/16.jpg",
    "video":"https://www.youtube.com/embed/96SQVn8nJtc",
    "bio":"I believe that we all have the characteristics to face life's challenges, but sometimes we may need some help recognizing our strengths. I utilize a multidimensional approach to therapy, exploring each individual's biological, psychological, social, and spiritual needs. I like to assist in helping others heal from trauma, build self-worth, improve communication in relationships, and reach goals. With compassion and understanding, I work with each individuals to help them build on their strengths and attain the personal growth they are committed to accomplishing."
  },      
  {
    "code":"bg-warning",
    "id":"michelle",
    "name":"Michelle Melendres, Ed.D., MSW",
    "title": "Clinical Social Worker",
    "license":"ASW 97729",
    "photo":"assets/img/teams/17.jpg",
    "video":"https://www.youtube.com/embed/BKdNMvCKzhg",
    "bio":"My name is Dr. Michelle Melendres and I am an Associate Clinical Social Worker, under the supervision of Dr. Inga Simonian. Originally from Hawaii, I have a Master of Science in Social Work from Columbia University and a Doctoral Degree in Education from the University of California, Los Angeles. Because everyone's journey and circumstances are different, my therapeutic approach is one that is customized specifically to you, cognizant of your unique background and understanding the complex intersectionality of your identity. I integrate a mindfulness-based approach through an in-depth assessment that will focus on your strengths and build your capacity to be present. Through the work we do, my hope is to empower you to cultivate self-compassion to feel much more balanced and whole. While working with you, I will incorporate an ecological framework and biological, psychological, social, and spiritual approach that takes into consideration all aspects of who you are, what your circumstances are, the environment in which you are in, and the changes that come with these."
  },
        {
    "code":"bg-success",
    "id":"stefanie",
    "name":"Stefanie Garcia, LMFT",
    "title": "Marriage and Family Therapist",
    "license":"LMFT111393",
    "photo":"assets/img/teams/12.jpg",
    "video":"",
    "bio":"My name is Stefanie Garcia and it is my calling to serve and guide people on their journey toward healing and finding their inner strength. In my 8 years of practice as a Marriage and Family Therapist, I have ministered to adults, families and children from all walks of life who have been struggling with issues ranging from depression and anxiety to new motherhood, childhood behavior issues, trauma, Department of Child and Family Services (DCFS) cases and those looking to find meaning toward the end of their lives. As a strengths based cognitive behavioral therapist, I work to empower clients to use their own strengths to discover new ways to change their lives. I provide a safe and compassionate environment where clients can explore their thoughts, feelings, and experiences without judgment. I help clients identify the thought processes that create and maintain their negative view of themselves, others, and the world around them. Through talk therapy, I assist the client in shifting they way they view and approach their lives in order for them to foster loving relationships with themselves and others. I work to highlight the client's inner resources to help them successfully navigate any situation that challenges them in life. I understand how difficult it can be to struggle with emotional pain and I feel truly honored when my clients allow me to join them on their journey of healing."
  },
   {
    "code":"bg-info",
    "id":"diamond",
    "name":"Diamond Huffman, Psy.D.",
    "title": "Psychological Assistant",
    "license":"PSB94025755",
    "photo":"assets/img/teams/19.jpg",
    "video":"",
    "bio":"Throughout all of my experiences I have worked with an extremely diverse clientele. Diversity and understanding the importance of social and cultural factors, and identity development has always been an interest of mine. My specialization is working in diversified communities of color primarily with at risk youth and young adults suffering from substance misuse, depression, anxiety and trauma."
  },
    {
    "code":"bg-success",
    "id":"edgar",
    "name":"Edgar Petrosyan, Ph.D.",
    "title": "Psychological Assistant",
    "license":"PSB94025898",
    "photo":"assets/img/teams/20.jpg",
    "video":"https://www.youtube.com/embed/_P0cJwk3XPk",
    "bio":"Introduction: Hello, my name is Dr. Edgar Petrosyan, and I am a Psychological Assistant with a Doctoral Degree in Clinical Psychology, with Emphasis in Depth Psychology, a modality primarily based on the theories of Carl G. Jung.  My approach to helping clients is based on the understanding that as we move forward in life/time, we come across challenges that sometimes make it difficult for us to move forward.  These challenges may have been experienced anytime from infancy to adulthood.  Due to the passage of time and natural defenses, we may no longer be aware of how we are still effected by the difficulties experienced in our past, which may be nothing more then a feeling, or a pattern of relationships.  These effects may be embodied as depression, anxiety, addiction, relationship difficulties, and so on.  My goal as your therapist will be to help you build a better relationship with yourself by challenging you to navigate through the difficult emotions at an appropriate pace, which will naturally lead to improved relationships and overall happiness.  I approach each of my clients as unique individuals, a uniqueness that some may say is forged by chance, such as, year of birth, culture and family in which the person is born into, childhood experiences, personality traits, unconscious drives, and so on.  Therefore, I approach each individual with the respect that all these factors, as well as those not mentioned, helped forge you into a one of a kind masterpiece in the making, a work of art for which there is no replica."
  },
  {
    "code":"bg-warning",
    "id":"Debbi",
    "name":"Debbi Odell, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT130890",
    "photo":"assets/img/teams/25.jpg",
    "video":"",
    "bio":"Hi, I’m Debbi Odell, an Associate Marriage and Family Therapist with nine years of experience in the mental health field.  I earned my masters at Antioch University of Santa Barbara with a Somatic concentration, and I am currently working toward an Expressive Arts Therapy certificate.  I am LGBTQ+ and social justice-allied, and I use client-centered, trauma-informed, attachment, and Internal Family Systems approaches combined with expressive arts and somatic interventions.  I work with children, teens, adults, couples, and families, helping clients with many issues including grief, anxiety, depression, trauma, mental illness, and relationships.  I believe the therapeutic relationship needs to have safety, trust, respect, and honest communication, so I collaborate with clients to create an environment that feels supportive.  I look forward to meeting you and working together toward a more fulfilling life."
  },
  {
    "code":"bg-info",
    "id":"daina",
    "name":"Daina Castro, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT128350",
    "photo":"assets/img/teams/23.jpg",
    "video":"https://www.youtube.com/embed/OoDvYUem93I",
    "bio":"Hello, my name is Daina Castro, and I am an Associate Marriage and Family therapist working under the supervision of Dr. Inga Simonian.  I welcome you to therapy and I truly am so happy that you are taking this next step in your life. My role as a therapist is to help you discover your most authentic self and achieve your goals through a safe, non-judgmental, and compassionate space. I believe that therapy is a collaborative experience, and I work with each and every one of my clients to gain their trust as well as form a relationship with them. I look forward to meeting with you and starting our journey together."
  },
  {
    "code":"bg-primary",
    "id":"alex",
    "name":"Alex Barragan, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT127891",
    "photo":"assets/img/teams/24.jpg",
    "video":"",
    "bio":"Hi there! Congratulations on taking a step towards change. My name is Alex Barragan, and I work as a Marriage and Family Therapist and a Professional Clinical Counselor Associate under Dr. Shani Habibi. Mental health and social justice are two issues that I am passionate about. I believe that therapy can not only be a life-changing experience, but also a life-saving one. Whether you're dealing with painful emotions, troubling thoughts, a loss, or simply need support as you go through a transition or stressful event, I am here to help. I'll concentrate on developing a strong, genuine relationship with you while utilizing the science of evidence-based treatment to assist you in achieving your goal. My approach is highly collaborative, in the sense that we work together to identify problems and come up with creative solutions that are right for you. My goal as a therapist is to accompany you on your journey of self-discovery and assist you in solving problems and discovering your own authentic, fulfilling path in life. I'm here to assist you in discovering your inner resources and strengths so that you can heal, grow, thrive, and live the life you want. I hope to have the opportunity to collaborate with you on this first step. I work with adolescents and adults who are dealing with depression, anxiety, trauma, relationship issues, and LGBTQIA+ related issues. I hope to have the opportunity to work alongside you in taking this first step toward a more rich and fulfilling life."
  },
   {
    "code":"bg-info",
    "id":"lara",
    "name":"Lara Loest, MA",
    "title": "Psychological Assistant",
    "license":"PSB94026628",
    "photo":"assets/img/teams/26.jpg",
    "video":"",
    "bio":"Welcome! I'm glad you are here! My name is Lara Loest and I am a psychological associate working under the supervision of Dr. Inga Simonian. I work with trauma survivors and people experiencing anxiety, depression, PTSD, and other stressful life events. I also have experience with eating disorders and domestic violence recovery. My specialties include providing trauma-informed and culturally-sensitive care to a diverse population through the use of treatments like Narrative Exposure Therapy, DBT skills, mindfulness techniques, and a holistic strengths-based perspective. What that means for you is that together we will focus on discovering your natural skills and strengths to work through whatever difficulties you are experiencing right now. Let's find your unique path to living your most fulfilling life. I'm excited for your journey and look forward to being a part of it. "
  },
   {
    "code":"bg-success",
    "id":"Juliana",
    "name":"Juliana Amiri, LMFT",
    "title": "Marriage and Family Therapist",
    "license":"LMFT81230",
    "photo":"assets/img/teams/27.jpg",
    "video":"",
    "bio":"Hi! My name is Juliana Amiri and I have been a Licensed Marriage and Family Therapist since 2014; graduated from Cal State Northridge in 2008. I value the importance of human connection and collaboration.   The relationship and connection which a client and therapist develop between them is the single biggest factor for successful psychotherapy.  I am of the belief that therapy should not be a forever journey, but rather an opportunity to become introspective and explore the path which is right for you personally.    I use a combination of evidence based therapeutic modalities, including but not limited to Cognitive Behavior Therapy, Dialectical Behavior Therapy, Systems Family Therapy and Person Centered therapy.  My goal is to help you improve the relationship you have with yourself mentally, physically, emotionally and spiritually. In the process, we will focus on exploring your history, family background, and reflect on emotional processes and individual concerns.  Through getting in touch with these truths you are able to realize healthier and happier lives and relationships.  When it comes to navigating life’s challenges, I believe the best guidance comes from within. My role is to offer support and a safe space for clients to process and uncover their own wisdom.  I help my clients improve their lives by increasing awareness, and mindfulness.  Together we will take the journey to build healthy coping skills that support resilience in overcoming challenging obstacles. I look forward to sharing the experience with you."
  }
]
