[
    {
    "code":"bg-primary",
    "id":"inga",
    "name":"Inga Simonian, Ph.D.",
    "title": "Clinical Psychologist",
    "license":"PSY25302",
    "photo":"assets/img/teams/34.jpg",
    "video":"",
    "bio":"I am the founder and director of Conscious Connections Psychology Group, a holistic group practice with a diverse team of therapists that treat the whole person, family and community. We have 25 therapists in our practice and three locations, including a somatic studio.  I obtained my Bachelor’s Degree from UC Irvine and my Master’s and PhD from California Professional School of Psychology at AIU, Alhambra.  My training journey began at Santa Anita Family Service as a practicum student, where I held families with love and presence. At a time when I didn’t have any formal therapy experience, my intuition and true self started peeking through with beautiful souls going through darkness from all corners. Following that, I did an internship at BHC Alhambra Hospital in their intake department as well as the inpatient and outpatient units, assessing and treating acute crisis patients of all ages. I continued working at the hospital while transitioning to the Wright Institute where I got formal training in psychoanalytic theory with reputable analysts from the West LA area and saw patients multiple times a week. I did my second internship at La Vie Counseling Center where I stepped out of the books and into soul with faith based therapy and intersubjective training. I started my practice in 2012 and it grew naturally and gradually into what it is today, with the help of my husband with the behind the scenes support. In 2017 I obtained a one-year training certificate from the C.G. Jung Institute of Los Angeles, and since completing that study, I have been a participating member of a monthly alchemy seminar.  Today I am an artist, dancer, mother and currently studying and writing music. My art has been featured in the Mirrors of The Mind Psychotherapist as Artist exhibit in Los Angeles. Although many of you won’t see me as a client, my hands are on the therapists that treat you and I oversee your healing process. There is nothing more courageous than saying yes to death of the old self and beginning anew. Thank you for unbecoming. We are here to help birth the real you."
  },
    {
    "code":"bg-warning",
    "id":"jane",
    "name":"Jane Oh, Ph.D.",
    "title": "Clinical Psychologist",
    "license":"PSY26714",
    "photo":"assets/img/teams/02.jpg",
    "video":"https://www.youtube.com/embed/d5zh-jdtT3A",
    "bio":"I started on my journey to learn about human relationships at UC Davis where I received my bachelor's degrees in psychology and sociology. I continued my education at California School of Professional Psychology at Alliant International University earning a master's and doctoral degree. I began my training with a focus on child and family psychotherapy through community clinics providing services to foster children and low income families. Through my training I have gained expertise in working with children and teens through individual and family therapy. Working with families has allowed me gain expertise in working with individuals of various ages with consideration of how family history and relationships impact who they are and obstacles they may face. I have successfully assisted parents in strengthening their parenting skills while helping them feel empowered. Upon licensure I began working with children ages 2-5 focused on assisting caregivers with building a strong positive relationship in order for both caregiver and child to become resilient and successful. I am currently working on certification in Parent Child Interaction Therapy through UC Davis. I also have a passion for working with children and adults with ADHD knowing that the challenges can be a lifelong struggle. I work with a strength based approach knowing that individuals have internal resources to help them overcome any difficulties they are facing. Knowing that humans and relationships are constantly evolving, I continue my journey in professional development in an effort to learn approaches that will best help individuals."
  },
      {
    "code":"bg-info",
    "id":"tammy",
    "name":"Tammy Moshrefi, AMFT",
    "title": "Associate Marriage and Family",
    "license":"AMFT144643",
    "photo":"assets/img/teams/22.jpg",
    "video":"",
    "bio":"Hello and welcome! My name is Tammy Moshrefi and I am an Associate Marriage and Family Therapist working under the supervision of Dr. Inga Simonian. I applaud you in taking the first step towards healing, self awareness and discovering your authentic self. My goal as a therapist is to support and empower individuals struggling with complex disorders and those who simply need help trying to navigate their way through life. My approach to therapy is client centered, which means we will work collaboratively to develop an approach that works best for you in reaching your goals. Vulnerability can be difficult and I thank you for allowing me to be part of your healing journey. "
  },
    {
    "code":"bg-success",
    "id":"rosanna",
    "name":"Rosanna Daragchyan, LMFT",
    "title": "Marriage and Family Therapist",
    "license":"LMFT111393",
    "photo":"assets/img/teams/03.jpg",
    "video":"https://www.youtube.com/embed/VLvtG1wjNF4",
    "bio":"I completed my graduate work at California State University, Northridge. My program is nationally accredited by the Commission for the Accreditation of Marriage and Family Therapy Education, and is one of two such accredited programs in the region. I received excellent training from impeccable instructors and supervisors that not only provided the therapeutic techniques and strategies necessary for the therapeutic process, but also genuinely cared for the well being of clients. I have provided therapy for individuals, children, adolescents, couples, groups, and families. I am trained in using systemic, collaborative, humanistic, strength based, and evidence based theoretic approaches. My treatment style is always adapted to the clients' individual needs. I specialize in treating mental and emotional disorders, such as depression, anxiety, cognitive disabilities, grief and loss, and various adjustment disorders. I value the importance of a trusting relationship between therapist and client. I strive to provide safety and comfort to discuss subjects freely, without the fear of judgment or shame. I also recognize the importance of being culturally aware of the differences and pressures family customs or beliefs can have on individuals. My goal is to provide a healing experience that allows for growth and strength to be accentuated, while providing tools and skills that can be used daily. This is your personal path of discovery, I am simply a messenger on the way."
  },
    {
    "code":"bg-info",
    "id":"suzanne",
    "name":"Suzanne Smith, Psy.D.",
    "title": "Psychological Associate",
    "license":"PSB9402125",
    "photo":"assets/img/teams/04.jpg",
    "video":"https://www.youtube.com/embed/uy_A7-HplTg",
    "bio":"I am a psychological assistant with a doctorate degree in Clinical Psychology specializing in working with children, adolescents, and adults who are experiencing a wide range of behavioral, developmental, emotional, and relational difficulties. My approach is primarily cognitive behavioral evidence based therapy. My focus is on present day concerns, abolishing the self-defeating behaviors, empowering clients reduce stress, and lead emotionally balanced and fulfilling life.I specialize in: Dealing with parental stress and depression raising children with developmental challenges such as Autism Spectrum Disorders (ASD), and ADHD. Improving parent child communication, and decreasing parental stress. I help parents to understand children's unique emotional needs, and specific communication styles. Working with adults: I provide a supportive environment for healing. I help to facilitate positive change for my clients. I work with individuals who seek help with a wide range of concerns, such as anxiety, depression, anger, stress, post-traumatic stress disorder, relationship issues, and work related problems. I focus on creating a safe place for my clients in a welcoming, warm and caring practice, offering the safety to explore and express painful and difficult emotions in a confidential setting."
  },
      {
    "code":"bg-success",
    "id":"Kathleen",
    "name":"Kathleen Nogoy, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT153080",
    "photo":"assets/img/teams/32.jpg",
    "video":"https://www.youtube.com/embed/TMGoiMIuY5c",
    "bio":"Thank you for choosing to be here. I’m Kathleen Nogoy, an Associate Marriage and Family Therapist. I earned my Master’s in Marriage and Family Therapy from Alliant International University, where I built a strong foundation for supporting others with intention and care. I believe that within each of us lives a version that feels more connected, calm, and at ease—and my hope is to help you reconnect with that part of yourself. In our work together, you’ll find a warm, non-judgmental space to reflect, be curious, and gently explore the layers of your inner world. Therapy is a collaborative journey, and I’m here to walk alongside you—offering tools and insights you can carry with you not only in session, but throughout your everyday life. Reaching out is a meaningful first step. We can begin with a brief consultation to see if this space feels right for you."
  },
       {
    "code":"bg-primary",
    "id":"triana",
    "name":"Triana Reyes, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT144575",
    "photo":"assets/img/teams/15.jpg",
    "video":"",
    "bio":"Greetings! My name is Triana Reyes, and I am an Associate Marriage and Family Therapist under the supervision of Inga Simonian, PhD. I hold a master’s degree in Marriage and Family Therapy with a focus on Trauma from Pacific Oaks College in Pasadena. My mission is to walk alongside you on your journey, serving as a healthy reflection of the positive changes you can make in your life. I believe in a client-centered approach, incorporating somatic modalities, breathwork, and mindfulness to help you achieve the goals you set for yourself. I specialize in supporting clients through various life transitions, grief, relationship issues, family dynamics, and romantic dynamics. Whether you’re navigating the complexities of life or dealing with depression, anxiety, and trauma, I am here to help you roll with the punches and find your path. Drawing on ancestral wisdom and my own personal experiences, I focus on spirituality and transpersonal development. My trauma-informed expertise includes maternal mental health, mindfulness, polyvagal theory, career transitions, effective communication, romantic relationships, friendships, identity, and parenting. My goal is to support you in your healing and self-discovery journey, helping you believe in a better future. Together, we can work towards the positive changes you seek, embracing the processes that come up while living life. Let’s embark on this journey together, with hope and confidence in the brighter days ahead."
  },
        {
    "code":"bg-warning",
    "id":"shani",
    "name":"Shani Habibi, Ph.D.",
    "title": "Licensed Psychologist",
    "license":"PSY26779",
    "photo":"assets/img/teams/13.jpg",
    "video":"",
    "bio":"Shani Habibi is an Associate Professor and the Director of the Masters in Science program at Mount Saint Mary's University.   She received her Ph.D. in Clinical Psychology with an emphasis in Multicultural Communications from the California School of Professional Psychology at Alliant International University and has been studying bisexuality for 18 years. She is trained as a Cognitive Behavioral Therapist as well as a Systemic Therapist and has treated clients in a variety of clinical settings, mainly in a community mental health clinic and at an inpatient psychiatric hospital."
  },
        {
    "code":"bg-primary",
    "id":"amanda",
    "name":"Amanda Romero, Ed.D., LCSW",
    "title": "Licensed Clinical Social Worker",
    "license":"LCSW124664",
    "photo":"assets/img/teams/16.jpg",
    "video":"https://www.youtube.com/embed/96SQVn8nJtc",
    "bio":"Dr. Amanda R. Romero, Ed.D., MSW, LCSW, is a licensed clinical social worker who takes a relational and trauma-informed approach to therapy. My areas of expertise include intimate partner violence (IPV), addiction, couples work, parenting, narcissistic abuse recovery, and healing. I also specialize in addressing high-conflict and contentious divorces, custody challenges, work/life balance, depression, anxiety, and personality disorders. I am dedicated to empowering individuals and families to navigate complex life challenges with resilience and clarity, fostering well-being and personal growth."
  },      
  {
    "code":"bg-warning",
    "id":"michelle",
    "name":"Michelle Melendres, Ed.D., MSW, LCSW",
    "title": "Licensed Clinical Social Worker",
    "license":"LCSW 125532",
    "photo":"assets/img/teams/17.jpg",
    "video":"https://www.youtube.com/embed/BKdNMvCKzhg",
    "bio":"My name is Dr. Michelle Melendres, a Licensed Clinical Social Worker with a passion for supporting individuals through their unique journeys. Originally from Hawai'i, I have a Master of Science in Social Work from Columbia University and a Doctorate in Education from the University of California, Los Angeles. I believe that each person's path to healing and wellness is as unique as their story, and my approach to therapy is deeply tailored to honor your individual background, experiences, and the complex intersectionality of your identity. I incorporate an ecological framework that takes into account the biological, psychological, social, and spiritual aspects of who you are, your unique circumstances, and the environments in which you live. I take an integrative, trauma-informed, mindfulness-based, and culturally-sensitive approach to therapy, focusing on your strengths and building your resilience. I specialize in working with athletes and individuals in high-performance sports environments, grief and loss, life transitions, work-life balance, cultural oppression, relationship and family dynamics, and generational trauma. I have experience in working with individuals who seek support for navigating through their anxiety, depression, adjustment disorders, personality disorders, PTSD, and trauma-related issues. Through our collaborative work together, I aim to empower you to develop self-compassion and deepen your capacity for presence and self-awareness.  It would be my privilege to support you on your journey toward healing, growth, and personal empowerment."
  },
        {
    "code":"bg-success",
    "id":"stefanie",
    "name":"Stefanie Garcia, LMFT",
    "title": "Marriage and Family Therapist",
    "license":"LMFT111393",
    "photo":"assets/img/teams/12.jpg",
    "video":"",
    "bio":"My name is Stefanie Garcia and it is my calling to serve and guide people on their journey toward healing and finding their inner strength. In my 8 years of practice as a Marriage and Family Therapist, I have ministered to adults, families and children from all walks of life who have been struggling with issues ranging from depression and anxiety to new motherhood, childhood behavior issues, trauma, Department of Child and Family Services (DCFS) cases and those looking to find meaning toward the end of their lives. As a strengths based cognitive behavioral therapist, I work to empower clients to use their own strengths to discover new ways to change their lives. I provide a safe and compassionate environment where clients can explore their thoughts, feelings, and experiences without judgment. I help clients identify the thought processes that create and maintain their negative view of themselves, others, and the world around them. Through talk therapy, I assist the client in shifting they way they view and approach their lives in order for them to foster loving relationships with themselves and others. I work to highlight the client's inner resources to help them successfully navigate any situation that challenges them in life. I understand how difficult it can be to struggle with emotional pain and I feel truly honored when my clients allow me to join them on their journey of healing."
  },
   {
    "code":"bg-info",
    "id":"diamond",
    "name":"Diamond Huffman, Psy.D.",
    "title": "Psychological Assistant",
    "license":"PSB94025755",
    "photo":"assets/img/teams/19.jpg",
    "video":"",
    "bio":"Throughout all of my experiences I have worked with an extremely diverse clientele. Diversity and understanding the importance of social and cultural factors, and identity development has always been an interest of mine. My specialization is working in diversified communities of color primarily with at risk youth and young adults suffering from substance misuse, depression, anxiety and trauma."
  },
    {
    "code":"bg-success",
    "id":"douye",
    "name":"Douye Youduba, Psy.D., MSW",
    "title": "Psychological Associate",
    "license":"PSB94026636",
    "photo":"assets/img/teams/20.jpg",
    "video":"",
    "bio":"Welcome! My name is Dr. D. Youduba and I am a Psychological Associate with a Doctoral Degree in Clinical Psychology working under the supervision of Dr. Shagheyegh Habibi. I will start by saying that the issues of life can be challenging and daunting which can cause one to feel a sense of fear, uneasiness, powerlessness, imbalance, hopelessness, weariness, disconnectedness, shame, anger, and the list goes on. However, there is hope in the face of seeking help. As a therapist, my primary goal is to be of service to you and collaborate with you on your journey of self-discovery and utilizing your strengths to overcome the challenges before you. To make you feel welcomed and comfortable, I will also provide you with a safe and therapeutic space that allows you to explore and express your innermost feelings, thoughts, emotions, and life experiences. I have extensive experience working with diverse populations on issues such as mood disorders such as depression, anxiety, trauma-related issues, relationship challenges, self-esteem issues, and grief and loss. Through a collaborative effort, I am here to assist you in exploring your concern(s) and empowering you in embracing a new perspective towards attaining positive overcomes. I employ a strengths-based, wholistic approach as well as draw from a variety of treatment modalities such as cognitive-behavioral therapy, psycho-dynamic, and rational-emotive counseling that is tailored to meet your individual needs. I also integrate self-awareness and mindfulness in my therapeutic style which would assist you in developing in-depth insight and focus on the present. I hope to have the opportunity to collaborate with you and to be of service in actualizing your mental health goal(s)."
  },
  {
    "code":"bg-info",
    "id":"lady",
    "name":"Lady Bevel, PA",
    "title": "Psychological Associate",
    "license":"PA94028854",
    "photo":"assets/img/teams/33.jpg",
    "video":"",
    "bio":"I am a depth psychologist in training with expertise in narrative therapy, mindfulness, psychodynamic approaches, Jungian analysis, and motivational therapy who weaves together multiple therapeutic traditions to explore the subconscious , personal stories, and the transformative power of self-awareness. My goal is to meet clients where they are, guiding them with compassion and insight as they navigate their path toward self-growth. I am passionate about creating a safe and supportive space, my intention is helping clients explore their personal narratives with courage and self-awareness. My empathic nature and spiritual awareness encourages a mindful approach to healing, empowering clients to examine, observe, and overcome obstacles."
  },
  {
    "code":"bg-warning",
    "id":"daina",
    "name":"Daina Castro, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT128350",
    "photo":"assets/img/teams/23.jpg",
    "video":"https://www.youtube.com/embed/OoDvYUem93I",
    "bio":"Hello, my name is Daina Castro, and I am an Associate Marriage and Family therapist working under the supervision of Dr. Inga Simonian.  I welcome you to therapy and I truly am so happy that you are taking this next step in your life. My role as a therapist is to help you discover your most authentic self and achieve your goals through a safe, non-judgmental, and compassionate space. I believe that therapy is a collaborative experience, and I work with each and every one of my clients to gain their trust as well as form a relationship with them. I look forward to meeting with you and starting our journey together."
  },
  {
    "code":"bg-primary",
    "id":"jimmy",
    "name":"Jimmy Barker, AMFT",
    "title": "Marriage and Family Therapist",
    "license":"AMFT156012",
    "photo":"assets/img/teams/25.jpg",
    "video":"https://www.youtube.com/embed/DZzIhXuJ4ls",
    "bio":"My name is Jimmy Barker. I offer therapy for people who feel stuck, overwhelmed, or disconnected - from themselves, from others, or from the life they want to be living. Whether you’re facing anxiety, relationship struggles, trauma, identity shifts, or a sense that something isn’t working, I provide a space to slow down and tune in. My approach isn’t about fixing you. It’s about creating a relationship where you feel deeply seen and heard, so that real healing and growth can emerge from within you. In our work together, I follow your pace and help you listen more closely to yourself - not just your thoughts, but the quieter signals in your body. I believe you carry a kind of inner knowing, even if it’s hard to hear at first. My role is to offer presence, curiosity, and care as you reconnect with that knowing and begin to move in a way that feels more true to who you are."
  },
   {
    "code":"bg-primary",
    "id":"lara",
    "name":"Lara Loest, Psy.D.",
    "title": "Psychological Assistant",
    "license":"PSB94026628",
    "photo":"assets/img/teams/26.jpg",
    "video":"https://www.youtube.com/embed/oQeQ1i77tmE",
    "bio":"Welcome! I'm glad you are here! My name is Lara Loest and I am a psychological associate working under the supervision of Dr. Inga Simonian. I work with trauma survivors and people experiencing anxiety, depression, PTSD, and other stressful life events. I also have experience with eating disorders and domestic violence recovery. My specialties include providing trauma-informed, kink-friendly, and culturally-sensitive care to a diverse population through the use of treatments like exposure therapy, DBT skills, mindfulness techniques, somatic inquiry, and a holistic strengths-based perspective. What that means for you is we focus on discovering your natural skills and strengths to work through whatever you are facing. Let's find your unique path to living your most fulfilling life. I'm excited for your journey and look forward to being a part of it. "
  },
   {
    "code":"bg-success",
    "id":"Gayaneh",
    "name":"Gayaneh Parsanj, ACSW",
    "title": "Associate Clinical Social Worker",
    "license":"ACSW115944",
    "photo":"assets/img/teams/27.jpg",
    "video":"",
    "bio":"In my role as a therapist, I take a collaborative approach that invites humor and complexity, helps you organize your thoughts, untangle yourself from mental confusion, and embrace life as you see fit. Emotional challenges may stem from perspectives that no longer work for us, a lack of an understanding of our true selves, and challenging circumstances. I strive to help others overcome these challenges in their day to day. Whether they stem from attachment ruptures, grief and loss, or trauma, I'm here to support you navigate life and have someone capable of being an effective resource for you."
  },
    {
    "code":"bg-warning",
    "id":"Deborah",
    "name":"Deborah Rosen, LMFT",
    "title": "Licensed Marriage and Family Therapist",
    "license":"LMFT153598",
    "photo":"assets/img/teams/28.jpg",
    "video":"",
    "bio":"I provide therapy for individuals, adolescents, children, couples, and groups.  As a therapist I aim to foster an environment from which the client can feel safe, heard, and supported. As a trauma-informed and culturally responsive therapist, evidence-based therapies such as Psychodynamic, CBT, Art, Narrative, Mindfulness, and Somatic therapies are utilized to best support individuals in overcoming obstacles and developing emotional well-being. Together we will harness your distinctive strengths, nurture a deeper understanding of self, and create movement towards your unique personal growth and healing. We will collaborate on identifying your goals and overcoming present-day difficulties.  I specialize in working with clients challenged by mental and emotional disorders, such as depression, anxiety, grief and loss, chronic pain, and various adjustment disorders.  I also specialize working with those experiencing infertility. I invite you to engage in this therapeutic process, to build upon your sense of agency, deepen trust of your inner wisdom, strengthen your voice, be authentic, and to work towards a life with balance and well-being. The potential for healing is within you. I will support you with curiosity and compassion, as we cultivate movement toward meaningful change. "
  },
    {
    "code":"bg-info",
    "id":"Rebecca",
    "name":"Rebecca Allen, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT156728",
    "photo":"assets/img/teams/35.jpg",
    "video":"",
    "bio":"Rebecca Allen is an Associate Marriage and Family Therapist who offers person-centered care rooted in cultural humility, deep empathy, and unconditional positive regard. She is passionate about creating safe, affirming spaces where individuals, couples, and families can heal, grow, and be fully seen. Rebecca’s journey into therapy was born from a personal calling—to become the kind of therapist she once searched for and couldn’t find. As a culturally rooted therapist and woman of color, she is deeply committed to providing culturally responsive care and advocating for representation within the therapeutic space. Her clinical work is trauma-informed, inclusive, and tailored to support diverse communities navigating issues such as anxiety, childhood trauma, relational distress, identity development, and life transitions. With a background in executive-level leadership and corporate career development, Rebecca brings a unique ability to understand the intersection of personal and professional challenges. She believes in the transformative power of presence and approaches each client with curiosity, respect, and a belief in their inherent resilience. Her work is guided by the principle that therapy is not just about solving problems, but about rewriting narratives, restoring peace, and reclaiming joy."
  },
    {
    "code":"bg-warning",
    "id":"Claudia",
    "name":"Claudia DuVal, APCC",
    "title": "Associate Professional Clinical Counselor",
    "license":"APCC15283",
    "photo":"assets/img/teams/30.jpg",
    "video":"https://www.youtube.com/embed/GNcZafMZs-M?si=RNhuhjRfv88N4Zy5",
    "bio":"Hello and glad you’re here! I am an Associate Professional Clinical Counselor working under the license of Inga Simonian, PhD. I completed my Master’s degree in Clinical Counseling from Alliant International University (CACREP accredited) San Diego. I am member of the honor society Chi Sigma Iota, American Counseling Association, and California Association for Licensed Professional Clinical Counselors. I am the daughter of an immigrant single mother and a mother of two sourpatch kiddos. I understand the unique lived experiences of Latina mamas and other marginalized women of color. I am bilingual in English and Spanish and offer telehealth. Areas that I am informed/affirmative include and not limited to: maternal mental health, mindfulness, polyvagal theory, trauma, spirituality, career transition, life transitions, effective communication, romantic relationships, friendships, identity. My area of expertise is perinatal mental health. In addition to my own postpartum experiences, I have been trained by Postpartum Support International on maternal mental health. I am also a volunteer for the organization and provide new mothers, fathers, and families with empathy and support. In my role, I am also a researcher and locate local and national resources for help seekers. I use a unique approach customized to the individual. I work with young children, teens, young adults, parents, and grandparents. My work is derived from Narrative Theory and belief that everyone has a unique story to share. As authors of our own lives, we can use Cognitive Behavioral Therapy (CBT) to make connections between our thoughts, feelings, and behaviors. We can use nature to calm our nervous system and practice mindfulness to be present in the moment. I also lean heavily on psychoeducation and provide resources like books, podcasts, informational videos, and many more tools to help you cope with life stressors when we are not together in session."
  },
    {
    "code":"bg-info",
    "id":"Denise",
    "name":"Denise Madrigal, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT144814",
    "photo":"assets/img/teams/31.jpg",
    "video":"",
    "bio":" Hi, my name is Denise Madrigal and I am an Associate Marriage & Family Therapist. I have a Master’s degree in Counseling Psychology.  My approach to therapy is humanistic, adapting therapy to the client's specific needs.  I am trained in Child Parent Psychotherapy, Multidimensional Family Therapy, and Cognitive Behavioral Therapy.  I am bilingual and certified to provide therapy to Spanish-speaking individuals, couples, and families.  I have experience working with children (including ages 0-5), adolescents, adults, families, and couples.  As a therapist, I strive to support my clients to strengthen their emotional well-being by developing insight and gaining tools they can use throughout their lives.  "
  },
    {
    "code":"bg-primary",
    "id":"Marina",
    "name":"Marina Vega, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT157828",
    "photo":"assets/img/teams/36.jpg",
    "video":"",
    "bio":"Marina Vega is an Associate Marriage and Family Therapist dedicated to providing compassionate care to individuals, couples, families, and children. She is under the direct supervision of Dr. Inga Simonian and is available for sessions both in person and via telehealth. Marina received her Master of Science in Counseling Psychology, with a specialization in Marriage and Family Therapy, from Mount Saint Mary's University, Los Angeles. Marina began training as a person-centered therapist in the UK after a career change as an educator, specializing in special education, and is a qualified yoga teacher. Marina works from a trauma-informed, holistic, and person-centered lens. She has experience supporting clients who have experienced significant trauma and PTSD, as well as members of the neurodivergent community. Marina is 2SLGBTQIA+ affirming and strives to create a safe, supportive, and inclusive space for all her clients."
  },
    {
    "code":"bg-success",
    "id":"Vanessa",
    "name":"Vanessa Petersen, AMFT",
    "title": "Associate Marriage and Family Therapist",
    "license":"AMFT",
    "photo":"assets/img/teams/37.jpg",
    "video":"",
    "bio":"Hello! I am a registered Associate Marriage and Family Therapist working with adults, couples, and children. As a therapist, I strive to create a safe, non-judgmental space where you have room to be heard and to explore what’s true to you. I provide a warm, collaborative style and believe meaningful and lasting change comes from within. We will process what’s heavy and work to understand the thoughts, behaviors, or relational patterns that are no longer serving you. With over 20 years in the non-profit cancer and chronic disease space, I am comfortable working with individuals going through a diagnosis, recurrence, or who are caregiving for ill or aging family members, and/or dealing with grief. I also have experience working with the older adult (65+) population, as well as those caring for aging family members, specifically with dementia."
  }
]
